In [2]:
import pandas as pd
import numpy as np

In [3]:
import pandas as pd

# create two data frames
df1 = pd.DataFrame({'id': [1, 2, 3, 4], 'value1': [10, 20, 30, 40]})
df2 = pd.DataFrame({'id': [2, 4, 5, 6], 'value2': [50, 60, 70, 80]})

# merge the two data frames on the 'id' column
merged_df = pd.merge(df1, df2, on='id', how = 'right')

# print the merged data frame
print(merged_df)

   id  value1  value2
0   2    20.0      50
1   4    40.0      60
2   5     NaN      70
3   6     NaN      80

To deal with missing values in the merged data frame, you can use the how parameter of the merge() function. The how parameter specifies the type of join to be performed, and can take one of four values: 'inner', 'outer', 'left', or 'right'.

- 'inner' join: only include rows where the ID column is present in both data frames.
- 'outer' join: include all rows from both data frames, and fill in missing values with NaN.
- 'left' join: include all rows from the left data frame, and fill in missing values with NaN for any rows that do not have a matching ID in the right data frame.
- 'right' join: include all rows from the right data frame, and fill in missing values with NaN for any rows that do not have a matching ID in the left data frame.
Here's an example of how to use the how parameter to perform an outer join and handle missing values:

In [4]:
import pandas as pd

# create two data frames
df1 = pd.DataFrame({'id': [1, 2, 3, 4,9], 'value1': [10, 20, 30, 40, 90]})
df2 = pd.DataFrame({'id': [2, 4, 5, 6], 'value2': [50, 60, 70, 80]})

# merge the two data frames on the 'id' column using an outer join
merged_df = pd.merge(df1, df2, on='id', how='outer')

# fill in missing values with 0
##merged_df.fillna(0, inplace=True)

# print the merged data frame
print(merged_df)

   id  value1  value2
0   1    10.0     NaN
1   2    20.0    50.0
2   3    30.0     NaN
3   4    40.0    60.0
4   9    90.0     NaN
5   5     NaN    70.0
6   6     NaN    80.0

In this example, we use an outer join to include all rows from both data frames and fill in missing values with NaN. We then use the fillna() function to replace the NaN values with 0. The resulting data frame merged_df will contain all rows from both data frames, with missing values filled in with 0.

In [5]:
'''
insert new column
df.insert(loc, 'colname', datafrom it)
# Drop column
df = df.drop('B', axis=1)
####Drop null
# df2 = df2.dropna(subset = [''])
#### df. = df[''].astype( 'int64')
##df.col.replace(np.nan, 38201.76, inplace = True)
##df.col.replace({'f':'femal'}, inplace = True)

########Drop specific value in column
# Drop the rows where the City is 'Chicago'
#df = df[df['City'] != 'Chicago']
'''
#change value in column with another value
# change the value 'Chicago' to 'Boston' in the 'City' column
#df.loc[df['City'] == 'Chicago', 'City'] = 'Boston'

"\ninsert new column\ndf.insert(loc, 'colname', datafrom it)\n# Drop column\ndf = df.drop('B', axis=1)\n####Drop null\n# df2 = df2.dropna(subset = [''])\n#### df. = df[''].astype( 'int64')\n##df.col.replace(np.nan, 38201.76, inplace = True)\n##df.col.replace({'f':'femal'}, inplace = True)\n\n########Drop specific value in column\n# Drop the rows where the City is 'Chicago'\n#df = df[df['City'] != 'Chicago']\n"

# Fist sheet: Transactions

In [6]:
# import sheet as data frame
df = pd.read_excel('I work on .xlsx', header = 1, sheet_name='Transactions')

In [7]:
# columns names 
df.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [8]:
df.head(2)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0

In [9]:
df.dtypes

transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

<h3> Null Values(Missing Ones)

In [10]:
# Number of null values
df.isna().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

<h4> Drop null values from Online Order column

In [11]:
df = df.dropna(subset=['online_order'])

In [12]:
df.online_order = df['online_order'].astype( 'int64')

In [13]:
df.online_order.isna().any()

False

<h4>  Fill null values from Product line column

In [14]:
# Number of null values
df.product_line.isnull().sum()

195

In [15]:
df.product_line.value_counts()

Standard    13920
Road         3894
Touring      1213
Mountain      418
Name: product_line, dtype: int64

In [16]:
# Fill using 'Standard' by Most frequance values
df['product_line'].replace(np.nan, 'Standard', inplace = True)

In [17]:
# Ensure no null values
df.product_line.isnull().sum()

0

## Drop null values from brand column

In [18]:
df.brand.value_counts()

Solex             4169
WeareA2B          3245
Giant Bicycles    3244
OHM Cycles        2993
Trek Bicycles     2931
Norco Bicycles    2863
Name: brand, dtype: int64

In [19]:
# Drop null values
df = df.dropna(subset = ['brand'])

In [20]:
# Ensure no null values
df.brand.isnull().sum()

0

## Drop naull values from product_size column

In [21]:
df.product_size.value_counts()

medium    12767
large      3900
small      2778
Name: product_size, dtype: int64

In [22]:
# Fill null values with most frequently value 'medium'
df.product_size.replace(np.nan, 'medium', inplace = True)

In [23]:
# Ensure no null values
df.product_size.isnull().any()

False

## Drop null values from product_class column

In [24]:
df.product_class.value_counts()

medium    13587
high       2952
low        2906
Name: product_class, dtype: int64

In [25]:
# Fill null values with most frequently value 'medium'
df.product_class.replace(np.nan, 'medium', inplace = True)

In [26]:
# Ensure no null values
df.product_class.isnull().any()

False

## Drop null values from standard_cost  column

In [27]:
df.standard_cost

0          53.62
1         388.92
2         248.82
3         381.10
4         709.48
          ...
19995    1203.40
19996     312.74
19997      44.71
19998     136.73
19999    1580.47
Name: standard_cost, Length: 19445, dtype: float64

In [28]:
# Get the value of mean and fill the null values with it
standard_cost_mean = round(df.standard_cost.mean(),2)

In [29]:
df.standard_cost.replace(np.nan, standard_cost_mean, inplace = True)

In [30]:
# Ensure no null values
df.standard_cost.isnull().sum()

0

<h3> Drop null values from product_first_sold_date column

In [31]:
df.product_first_sold_date

0        41245.0
1        41701.0
2        36361.0
3        36145.0
4        42226.0
          ...
19995    37823.0
19996    35560.0
19997    40410.0
19998    38216.0
19999    36334.0
Name: product_first_sold_date, Length: 19445, dtype: float64

In [32]:
# Fill null values with mean
product_first_sold_date_mean = round(df.product_first_sold_date.mean(),0)
product_first_sold_date_mean

38202.0

In [33]:
df.product_first_sold_date.replace( np.nan, product_first_sold_date_mean, inplace=True)

In [34]:
# Ensure no null values
df.product_first_sold_date.isnull().sum()

0

In [35]:
# Convert data type into int
df.product_first_sold_date = df['product_first_sold_date'].astype( 'int64')

In [36]:
df.product_first_sold_date.dtype

dtype('int64')

In [37]:
# Ensure that all the data frame has no null values
df.isna().sum()

transaction_id             0
product_id                 0
customer_id                0
transaction_date           0
online_order               0
order_status               0
brand                      0
product_line               0
product_class              0
product_size               0
list_price                 0
standard_cost              0
product_first_sold_date    0
dtype: int64

# Duplicate values

In [38]:
# Check duplicates
df.duplicated().sum()

0

<h4>There is no duplicated values in this sheet

# Second sheet: NewCustomerList

In [39]:
# import sheet
df2 = pd.read_excel('I work on .xlsx', sheet_name = 'NewCustomerList')

C:\Users\sohil\AppData\Local\Temp\ipykernel_28872\2228584396.py:2: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  df2 = pd.read_excel('I work on .xlsx', sheet_name = 'NewCustomerList')

In [40]:
df2.head(2)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.64,0.80,1.0000,0.850000,1,1,1.71875
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.51,0.51,0.6375,0.541875,1,1,1.71875

In [41]:
# columns names
df2.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

In [42]:
# Number of null values
df2.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

<h3> First_name & last_name columns</h1>

In [43]:
# fill two columns null values 
df2.first_name = df2.first_name.fillna('')
df2.last_name = df2.last_name.fillna('')

In [44]:
# Insert new column: Name
df2.insert(1, 'Name', (df2['first_name'] + ' ' + df2['last_name']))

In [45]:
# Delete first_name and last_name columns
df2.drop('last_name', axis=1, inplace = True)
df2.drop('first_name', axis=1, inplace=True)

In [46]:
df2.dtypes

Name                                           object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                          int64
address                                        object
postcode                                        int64
state                                          object
country                                        object
property_valuation                              int64
Unnamed: 16                                   float64
Unnamed: 17                                   float64
Unnamed: 18                                   float64
Unnamed: 19                                   float64
Unnamed: 20                                     int64
Rank                                            int64
Value                                         float64
dtype: object

In [47]:
# # Ensure no null values
df2.Name.isnull().sum()

0

<h3> Null values in DOB column

In [48]:
df2.DOB

0     1957-07-12
1     1970-03-22
2     1974-08-28
3     1979-01-28
4     1965-09-21
         ...
995   1959-10-07
996   2001-10-17
997   1954-10-05
998   1952-12-17
999   1955-10-02
Name: DOB, Length: 1000, dtype: datetime64[ns]

In [49]:
# Drop null values
df2 = df2.dropna(subset = ['DOB'])

In [50]:
# Ensure no null values
df2.DOB.isnull().sum()

0

<h3> Drop Null values in job_title & job_industry_category

In [51]:
# Drop null values
df2 = df2.dropna(subset=['job_title', 'job_industry_category'])

In [52]:
# Ensure no null values
df2.isnull().sum()

Name                                   0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_title                              0
job_industry_category                  0
wealth_segment                         0
deceased_indicator                     0
owns_car                               0
tenure                                 0
address                                0
postcode                               0
state                                  0
country                                0
property_valuation                     0
Unnamed: 16                            0
Unnamed: 17                            0
Unnamed: 18                            0
Unnamed: 19                            0
Unnamed: 20                            0
Rank                                   0
Value                                  0
dtype: int64

<h3> Duplicate values

In [53]:
df2.duplicated().any()

False

# Structural values

In [54]:
df2.gender.value_counts()

Female    380
Male      355
Name: gender, dtype: int64

In [55]:
df2.columns

Index(['Name', 'gender', 'past_3_years_bike_related_purchases', 'DOB',
       'job_title', 'job_industry_category', 'wealth_segment',
       'deceased_indicator', 'owns_car', 'tenure', 'address', 'postcode',
       'state', 'country', 'property_valuation', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

<h3> Drop unnamed columns and Select only named columns

In [56]:
df2 = df2.loc[:, ~df2.columns.str.match('Unnamed')]

<h3> deceased_indicator will be unuseful for analysis, all values are N

In [57]:
df2.deceased_indicator.value_counts()

N    735
Name: deceased_indicator, dtype: int64

In [58]:
df2 = df2.drop('deceased_indicator', axis=1)

<h3> country column is not useful for analysis

In [59]:
df2.country.value_counts()

Australia    735
Name: country, dtype: int64

In [60]:
df2 = df2.drop('country', axis = 1)

In [61]:
df2.state.value_counts()

NSW    364
VIC    200
QLD    171
Name: state, dtype: int64

In [62]:
df2.address.value_counts()

45 Shopko Center          1
0433 La Follette Road     1
3 Ruskin Hill             1
87 Crescent Oaks Alley    1
08822 Duke Road           1
                         ..
40553 Rigney Avenue       1
48578 Farmco Park         1
28 Golf View Terrace      1
0197 Sachs Avenue         1
21875 Grover Drive        1
Name: address, Length: 735, dtype: int64

In [63]:
df2.owns_car.value_counts()

No     376
Yes    359
Name: owns_car, dtype: int64

In [64]:
df2.tenure.value_counts()

9     58
11    53
13    48
7     47
12    47
10    46
17    46
16    43
5     42
15    42
8     42
14    36
6     33
4     29
18    25
19    22
20    17
21    16
3     15
2     11
22     9
1      8
Name: tenure, dtype: int64

In [65]:
df2.Rank.value_counts()

760     10
259     10
536      8
700      7
676      6
        ..
324      1
724      1
722      1
370      1
1000     1
Name: Rank, Length: 292, dtype: int64

In [66]:
df2.Value

0      1.718750
1      1.718750
2      1.718750
3      1.703125
4      1.703125
         ...
995    0.374000
996    0.357000
997    0.357000
998    0.357000
999    0.340000
Name: Value, Length: 735, dtype: float64

<h2> Dupliacted values

In [67]:
# check duplicates values
df2.duplicated().sum()

0

# Third sheet: CustomerDemographic

In [68]:
cdf = pd.read_excel('I work on .xlsx', sheet_name = 'CustomerDemographic')

C:\Users\sohil\AppData\Local\Temp\ipykernel_28872\605414936.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  cdf = pd.read_excel('I work on .xlsx', sheet_name = 'CustomerDemographic')

In [69]:
cdf.head(2)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0

In [70]:
cdf.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [71]:
cdf.dtypes

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
default                                        object
owns_car                                       object
tenure                                        float64
dtype: object

<h3> concate first name and last name in Name column

In [72]:
cdf.first_name = cdf.first_name.fillna('')
cdf.last_name = cdf.last_name.fillna('')

In [73]:
cdf.insert(1, 'Name',( cdf['first_name'] + ' ' + cdf['last_name']))

In [74]:
# drop two columns first and last name
cdf.drop('last_name', axis=1, inplace = True)
cdf.drop('first_name', axis=1, inplace=True)

In [75]:
cdf.Name

0           Laraine Medendorp
1                 Eli Bockman
2                Arlin Dearle
3                     Talbot
4       Sheila-kathryn Calton
                ...
3995         Rosalia Halgarth
3996            Blanch Nisuis
3997           Sarene Woolley
3998               Patrizius
3999            Kippy Oldland
Name: Name, Length: 4000, dtype: object

In [76]:
cdf.gender.value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [77]:
cdf.gender.replace({'F' : 'Female',
                    'M' : 'Male', 
                    'Femal' : 'Female'},
                   inplace = True)

In [78]:
# Drop U
# Drop the rows where the U, it is not know value
cdf = cdf[cdf['gender'] != 'U']

In [79]:
cdf.gender.value_counts()

Female    2039
Male      1873
Name: gender, dtype: int64

In [80]:
cdf.job_industry_category.value_counts()

Manufacturing         796
Financial Services    767
Health                596
Retail                358
Property              267
IT                    151
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

<h3>Drop defualt columns it will not be useful in analysis

In [81]:
cdf.drop('default', axis=1, inplace = True)

In [82]:
cdf.owns_car.value_counts()

Yes    1974
No     1938
Name: owns_car, dtype: int64

In [83]:
cdf.tenure.value_counts()

7.0     235
5.0     228
11.0    221
10.0    218
16.0    215
8.0     211
18.0    208
12.0    202
9.0     200
14.0    200
6.0     192
13.0    191
4.0     191
17.0    182
15.0    179
1.0     166
3.0     160
19.0    159
2.0     150
20.0     95
22.0     55
21.0     54
Name: tenure, dtype: int64

In [84]:
cdf.isnull().sum()

customer_id                              0
Name                                     0
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                              497
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
dtype: int64

In [85]:
df2 = df2.loc[:, ~df2.columns.str.match('Unnamed')]

<h3>Check dupliacates

In [86]:
cdf.duplicated().sum()

0

# fourth sheet: CustomerAddress

In [87]:
cadf = pd.read_excel('I work on .xlsx', sheet_name='CustomerAddress')

In [88]:
cadf.head(3)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9

In [89]:
cadf.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [90]:
cadf.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

In [91]:
cadf.state.value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [92]:
cadf.loc[cadf['state'] == 'New South Wales', 'state'] = 'NSW'

cadf.loc[cadf['state'] == 'Victoria', 'state'] = 'VIC'

In [93]:
cadf.state.value_counts()

NSW    2140
VIC    1021
QLD     838
Name: state, dtype: int64

In [94]:
cadf.country.value_counts()

Australia    3999
Name: country, dtype: int64

In [95]:
#Drop Australia columns from data it will be not useful in analysis 
## All values is  Australia
cadf.drop('country', inplace = True, axis=1)

In [96]:
cadf.property_valuation.value_counts()

9     647
8     646
10    577
7     493
11    281
6     238
5     225
4     214
12    195
3     186
1     154
2     143
Name: property_valuation, dtype: int64

In [97]:
cadf.head(4)

   customer_id              address  postcode state  property_valuation
0            1   060 Morning Avenue      2016   NSW                  10
1            2  6 Meadow Vale Court      2153   NSW                  10
2            4   0 Holy Cross Court      4211   QLD                   9
3            5  17979 Del Mar Point      2448   NSW                   4

<h3>Chech null values

In [98]:
cadf.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
property_valuation    0
dtype: int64

<h3>Check duplicates

In [99]:
cadf.duplicated().sum()

0